app/controllers/profiles_controller.rb

	def new
		# form for user to fill up own profile
		@user = User.find( params[:user_id] ) #determines logged in user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]